## Question-1

Missing values are the values which are not present in the dataset and are usually represented with NaN values. The missing values can be Missing at Random, Missing not at random, missing completely at random.

It is very essential to handle the missing values. Before handling them, we should try to understand the reason of having the missing values in our dataset. In order to have a model generalization, more accurate prediction and to reduce the bias in the results, we should handle the missing values.

The algorithms such as KNN, Random Forest can support the missing values in the dataset.

## Question-2

we can use the following techniques to handle the missing data:

a) Just dropping the missing values which is NOT recommended.

b) using the mean, median, mode.

c) Random sampling imputation

In [1]:
# Implementation part

In [3]:
import seaborn as sns

In [4]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

Using Mode - usually for the categorical variables

In [16]:
mode_value = df[df['embarked'].notna()]['embarked'].mode()[0]

In [17]:
df['embarked_imputed'] = df['embarked'].fillna(mode_value)

In [19]:
df[['embarked_imputed','embarked']]

    embarked_imputed embarked
0                  S        S
1                  C        C
2                  S        S
3                  S        S
4                  S        S
..               ...      ...
886                S        S
887                S        S
888                S        S
889                C        C
890                Q        Q

[891 rows x 2 columns]

using mean

Using Mean- it is sensitive to outliers

In [20]:
df['age_mean'] = df['age'].fillna(df['age'].mean())

In [21]:
df[['age_mean','age']]

      age_mean   age
0    22.000000  22.0
1    38.000000  38.0
2    26.000000  26.0
3    35.000000  35.0
4    35.000000  35.0
..         ...   ...
886  27.000000  27.0
887  19.000000  19.0
888  29.699118   NaN
889  26.000000  26.0
890  32.000000  32.0

[891 rows x 2 columns]

Using Median - not sensitive to outliers

In [23]:
df['age_median'] = df['age'].fillna(df['age'].median())

In [24]:
df[['age_median','age_mean','age']]

     age_median   age_mean   age
0          22.0  22.000000  22.0
1          38.0  38.000000  38.0
2          26.0  26.000000  26.0
3          35.0  35.000000  35.0
4          35.0  35.000000  35.0
..          ...        ...   ...
886        27.0  27.000000  27.0
887        19.0  19.000000  19.0
888        28.0  29.699118   NaN
889        26.0  26.000000  26.0
890        32.0  32.000000  32.0

[891 rows x 3 columns]

## Question-3

In a classification model, when the size of one class differs significantly from another class in the Output, then it is called an imbalanced dataset.

If the imbalanced dataset is not properly handled, them, it may lead to bias in the model and will not generate the accurate results

## Question-4

In upsampling, we add more data to the minority class. This type of technique is used when we don't want the loss of information and we have a limited amount of data with us. 

In downsampling, we remove the data from the majority class. This type of technique may be used when we have so much of data that the loss of removing the data is not into consideration. We are comfortable with the loss of information as we have a lot of data.

we can perform them using resample technique in sklearn.

## Question-5

Data Augumentation is a technique of creating a synthetic data for a existing data. SMOTE is an oversampling technique called as Synthetic Minority Oversampling technique.

It is used to address the imbalanced dataset when minority class has significantly fewer instances than the majority class. 

here we use Interplation technique to generate the synthetic variables and we try to increase the variance. We try to join the points and create a point through that and increase the variance.

## Question-6

Outliers in a datset are those points who are not following the trend in the dataset and are completely lying at a different position. They have the power to impact the learning of the model and can change the way we interpret the results. Outliers are extreme values in a dataset may be at a lower side or a higher side

Outliers are not always bad. They can be useful at times when we have the spam data. Therefore it becomes crucial to handle the outliers.

## Question-7

To handle the missing data, I'll try to find out the reason of missing data. If there is any specific reason or some dependency of missing data on some variable, then I'll try to include the variable.

Other options available is to impute the missing values using Mean, Median, Mode or random sampling imputation.

## Question-8

Here a small percentage of dataset is missing. Most probably it may be the Missing at random. There are very few chances of missing data having some pattern because if that would have been the case then, the missing values would be large.

Still, to make sure that it is a right approach, I'll try to analyse the data and the source of data and check for the reasons

## Question-9

For this kind of imbalanced dataset, we can use F-Beta score which considers both False positives and False negatives. So it is a good metrics for an imbalanced dataset. Also, we can adjust the weight of Precision and Recall depending upon the weightage we want for them.

We can also try to oversample the minority class or use the SMOTE technique. We can also use the Data Interpolation techniques like Linear/Cubic/Polynomial Interpolation

## Question-10

If we want to downsample the majority class, we can do so by downsampling by using the resample technique in sklearn.

Another way is to directly remove the majority class data points in order to balance the class beacause here the focus is towards the unsatisfied customers.

We can also try to upcample the minority class in order to create a balance.

Else, we can change the evaluation metrics and go for the F-beta score metrics as it is suitable for imbalanced datasets

## Question-11

For upsampling, we can use upsampling techniques, SMOTE, Data Interpolation techniques like Linear Interpolation, Cubic Interpolation, Polynomial Interpolation.

Else, we can use the F-beta score metrics to deal with the imabalanced dataset.